[
    {
        "id": 1,
        "title": "Spider-Man: No Way Home",
        "poster": "https://image.tmdb.org/t/p/original/1g0dhYtq4irTY1GPXvft6k4YLjm.jpg",
        "description": "Peter Parker is unmasked and no longer able to separate his normal life from the high-stakes of being a super-hero. When he asks for help from Doctor Strange the stakes become even more dangerous, forcing him to discover what it truly means to be Spider-Man.",
        "year": 2021,
        "rating": "NR",
        "genres": [
            "Action",
            "Adventure",
            "Science Fiction"
        ]
    },
    {
        "id": 2,
        "title": "The King's Man",
        "poster": "https://image.tmdb.org/t/p/original/aq4Pwv5Xeuvj6HZKtxyd23e6bE9.jpg",
        "description": "As a collection of history's worst tyrants and criminal masterminds gather to plot a war to wipe out millions, one man must race against time to stop them.",
        "year": 2021,
        "rating": "NR",
        "genres": [
            "Action",
            "Adventure",
            "Thriller",
            "War"
        ]
    },
    {
        "id": 3,
        "title": "The Commando",
        "poster": "https://image.tmdb.org/t/p/original/pSh8MyYu5CmfyWEHzv8FEARH2zq.jpg",
        "description": "An elite DEA agent returns home after a failed mission when his family makes an unexpected discovery in their house – a stash of money worth $3 million. They soon face the danger and threat of a newly released criminal and his crew, who will do whatever it takes to retrieve the money, including kidnap the agent’s daughters. Stakes are high and lives are at risk in this head-to-head battle as the agent stops at nothing to protect his family against the money-hungry criminals.",
        "year": 2022,
        "rating": "NR",
        "genres": [
            "Action",
            "Crime",
            "Thriller"
        ]
    },
    {
        "id": 4,
        "title": "Fistful of Vengeance",
        "poster": "https://image.tmdb.org/t/p/original/3cccEF9QZgV9bLWyupJO41HSrOV.jpg",
        "description": "A revenge mission becomes a fight to save the world from an ancient threat when superpowered assassin Kai tracks a killer to Bangkok.",
        "year": 2022,
        "rating": "NR",
        "genres": [
            "Action",
            "Crime",
            "Fantasy"
        ]
    },
    {
        "id": 5,
        "title": "Pursuit",
        "poster": "https://image.tmdb.org/t/p/original/wYihSXWYqN8Ejsdut2P1P0o97N0.jpg",
        "description": "Detective Breslin crosses paths with Calloway, a ruthless hacker desperate to find his wife, who has been kidnapped by a drug cartel. When Calloway escapes police custody, Breslin joins forces with a no-nonsense female cop to reclaim his prisoner. But is Calloway’s crime-boss father somehow involved in this explosive situation?",
        "year": 2022,
        "rating": "NR",
        "genres": [
            "Action",
            "Crime",
            "Thriller"
        ]
    },
    {
        "id": 6,
        "title": "My Hero Academia: World Heroes' Mission",
        "poster": "https://image.tmdb.org/t/p/original/4NUzcKtYPKkfTwKsLjwNt8nRIXV.jpg",
        "description": "A mysterious group called Humarize strongly believes in the Quirk Singularity Doomsday theory which states that when quirks get mixed further in with future generations, that power will bring forth the end of humanity. In order to save everyone, the Pro-Heroes around the world ask UA Academy heroes-in-training to assist them and form a world-classic selected hero team. It is up to the heroes to save the world and the future of heroes in what is the most dangerous crisis to take place yet in My Hero Academia.",
        "year": 2021,
        "rating": "NR",
        "genres": [
            "Animation",
            "Action",
            "Fantasy",
            "Adventure"
        ]
    },
    {
        "id": 7,
        "title": "Restless",
        "poster": "https://image.tmdb.org/t/p/original/aw4GGsRwhQtyLsjzC7dsAahfCDY.jpg",
        "description": "After going to extremes to cover up an accident, a corrupt cop's life spirals out of control when he starts receiving threats from a mysterious witness.",
        "year": 2022,
        "rating": "NR",
        "genres": [
            "Action",
            "Thriller",
            "Crime"
        ]
    },
    {
        "id": 8,
        "title": "Looop Lapeta",
        "poster": "https://image.tmdb.org/t/p/original/onGdT8sYi89drvSJyEJnft97rOq.jpg",
        "description": "When her boyfriend loses a mobster's cash, Savi races against the clock to save the day — if only she can break out of a curious cycle of dead ends.",
        "year": 2022,
        "rating": "NR",
        "genres": [
            "Action",
            "Comedy",
            "Crime"
        ]
    },
    {
        "id": 9,
        "title": "Red Notice",
        "poster": "https://image.tmdb.org/t/p/original/lAXONuqg41NwUMuzMiFvicDET9Y.jpg",
        "description": "An Interpol-issued Red Notice is a global alert to hunt and capture the world's most wanted. But when a daring heist brings together the FBI's top profiler and two rival criminals, there's no telling what will happen.",
        "year": 2021,
        "rating": "NR",
        "genres": [
            "Action",
            "Comedy",
            "Crime",
            "Thriller"
        ]
    },
    {
        "id": 10,
        "title": "Venom: Let There Be Carnage",
        "poster": "https://image.tmdb.org/t/p/original/rjkmN1dniUHVYAtwuV3Tji7FsDO.jpg",
        "description": "After finding a host body in investigative reporter Eddie Brock, the alien symbiote must face a new enemy, Carnage, the alter ego of serial killer Cletus Kasady.",
        "year": 2021,
        "rating": "NR",
        "genres": [
            "Science Fiction",
            "Action",
            "Adventure"
        ]
    },
    {
        "id": 11,
        "title": "The Matrix Resurrections",
        "poster": "https://image.tmdb.org/t/p/original/8c4a8kE7PizaGQQnditMmI1xbRp.jpg",
        "description": "Plagued by strange memories, Neo's life takes an unexpected turn when he finds himself back inside the Matrix.",
        "year": 2021,
        "rating": "NR",
        "genres": [
            "Science Fiction",
            "Action",
            "Adventure"
        ]
    },
    {
        "id": 12,
        "title": "Resident Evil: Welcome to Raccoon City",
        "poster": "https://image.tmdb.org/t/p/original/7uRbWOXxpWDMtnsd2PF3clu65jc.jpg",
        "description": "Once the booming home of pharmaceutical giant Umbrella Corporation, Raccoon City is now a dying Midwestern town. The company’s exodus left the city a wasteland…with great evil brewing below the surface. When that evil is unleashed, the townspeople are forever…changed…and a small group of survivors must work together to uncover the truth behind Umbrella and make it through the night.",
        "year": 2021,
        "rating": "NR",
        "genres": [
            "Horror",
            "Action",
            "Science Fiction"
        ]
    }
]